app/controllers/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "mohit1@gmail.com"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(email: params[:email])  # Fix the typo in the attribute name