app/controllers/comments_controller.rb

 def create
  @comments=@post.comments.new(comments_params)
   if @comments.save
---
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at", "parent_comment_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "superb"], ["user_id", 10], ["post_id", 46], ["created_at", "2023-08-17 07:07:14.390955"], ["updated_at", "2023-08-17 07:07:14.390955"], ["parent_comment_id", nil]]