app/controllers/likes_controller.rb

  def create
    @likes=@post.likes.new(like_params)
    if @likes.save
---
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 6], ["post_id", 36], ["created_at", "2023-08-18 05:32:11.168065"], ["updated_at", "2023-08-18 05:32:11.168065"]]

  def destroy
    @like=@post.likes.find(params[:id])
    if @like
      @like.destroy
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 36]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 11]]