app/controllers/posts_controller.rb

  def show
    @post = @user.posts.includes(:comments, :likes).find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? ORDER BY "comments"."created_at" DESC  [["post_id", 20]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 20]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["user_id", 2], ["id", 20], ["LIMIT", 1]]

   def user_post_by_user
    @user = User.find(params[:id])
    @post = @user.posts.includes(:comments, :likes)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN (?, ?, ?) ORDER BY "comments"."created_at" DESC  [["post_id", 4], ["post_id", 2], ["post_id", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" IN (?, ?, ?)  [["post_id", 4], ["post_id", 2], ["post_id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["user_id", 1]]

  def create
    @post = @user.posts.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("caption", "image", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["caption", "post_by_user_6"], ["image", "mk_6.jpg"], ["user_id", 6], ["created_at", "2023-08-18 10:31:46.771773"], ["updated_at", "2023-08-18 10:31:46.771773"]]

  def update
    @post = @user.posts.find(params[:id])
    if @post.user == @user && @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["user_id", 1]]
UPDATE "posts" SET "caption" = ?, "image" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["caption", "update_by_mohit"], ["image", "mohit.jpg"], ["updated_at", "2023-08-16 10:59:38.319633"], ["id", 4]]

  def destroy
    @post = @user.posts.find(params[:id])
    if @post.user == @user
      @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["user_id", 15], ["id", 49], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 49]]