app/controllers/users_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["user_id", 1]]
---
  def show
    follower_ids = @current_user.followers.pluck(:follower_id)
    followee_ids = @current_user.followees.pluck(:followee_id)
    post_user_ids = (follower_ids + followee_ids + [@current_user.id]).uniq
    @posts = Post.where(user_id: post_user_ids)