app/controllers/users_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["user_id", 23]]
---
  def user_post
    @user=User.find(params[:id])
    follower_ids = @user.followers.pluck(:follower_id)
    followee_ids = @user.followees.pluck(:followee_id)
    post_user_ids = (follower_ids + followee_ids + [@user.id]).uniq
    @posts = Post.where(user_id: post_user_ids)

INSERT INTO "users" ("first_name", "last_name", "username", "email", "profile_picture", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    @user =User.new(user_params)
    if @user.save

UPDATE "users" SET "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["updated_at", "2023-08-31 10:28:10.956300"], ["password_digest", "[FILTERED]"], ["id", 1]]
---
  def update
    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def unfollow
    @user = User.find(params[:id])
    current_user.followed_users.find_by(followee_id: @user.id).destroy
    redirect_back(fallback_location: user_path(@user))
  end
  private def set_user
    @user=User.find(params[:id])