app/models/comment.rb

  def create_comment_notification
    Notification.create(
      user: post.user,
      notifiable: self,
      notifiable_id: id,
      notifiable_type: 'Comment',
      message: "#{user.username} Commented on your post: #{post.caption}"
    )
---
INSERT INTO "notifications" ("user_id", "notifiable_id", "notifiable_type", "message", "read", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)