app/models/like.rb

SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 6], ["post_id", 36], ["LIMIT", 1]]
---
  def unique_like_for_user
    if Like.exists?(user_id: user_id, post_id: post_id)

INSERT INTO "notifications" ("user_id", "notifiable_id", "notifiable_type", "message", "read", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create_like_notification
    Notification.create(
    # byebug
    user: post.user,
    notifiable: self,
    notifiable_id: id,
    notifiable_type: 'Like',
    message: "#{user.username} liked your post: #{post.image}"
   )